app/controllers/home_controller.rb

	def loggin
		@user = User.find(:first, :conditions => ["name = :name AND password = :password", { :name => params[:user][:name], :password => params[:user][:password] }])
---
SELECT * FROM `users` WHERE (name = 'plop' AND password = 'plop') LIMIT 1

	def signup
		@user = User.new
		@user.name = params[:user][:name]
		@user.password = params[:user][:password]
		@user.password_confirmation = params[:user][:password_confirmation]
		@user.email = params[:user][:email]
		@user.money = 1000
		if @user.save
---
INSERT INTO `users` (`name`, `money`, `updated_at`, `password`, `email`, `created_at`) VALUES('plop', 1000, '2009-06-14 13:02:17', 'plopii', 'coin', '2009-06-14 13:02:17')

	def me
		if !session[:logged]
			redirect_to :action => :index
		elsif User.exists?(session[:user_id])
			@user = User.find(session[:user_id])
---
SELECT `users`.id FROM `users` WHERE (`users`.`id` = -1) LIMIT 1

	def editme
		if !session[:logged] then redirect_to :action => :index end
		@user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

	def update_me
		if !session[:logged] then redirect_to :action => :index end
		@user = User.find(session[:user_id])
		if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `email` = 'coinn', `password` = 'plopiiu', `updated_at` = '2009-06-14 13:02:51' WHERE `id` = 1